package topic14_dynamic_programming.practice;

import java.util.*;

public class Easy_10_04_HouseRobberEasy {

    /**
     * Drill 4/5 for Easy_10_HouseRobberEasy
     * 
     * Те саме, але після пограбування будинку ви повинні пропустити щонайменше 2 наступні будинки (заборонено грабувати сусідні та через один).
     */
    public int robSkipTwo(int[] nums) {
        // TODO: Implement your solution here.
        return 0;
    }

    /* 
     * =========================================================================
     * MENTEE QUESTION REGION
     * =========================================================================
     * Your Question: 
     * 
     */

    /* 
     * =========================================================================
     * MENTOR QUESTION TO MENTEE
     * =========================================================================
     * Mentor Question: Як зміниться DP-перехід, якщо не можна грабувати будинки на відстані менше 3 (тобто треба пропускати щонайменше 2 будинки)?
     * 
     * Your Answer: 
     * 
     */
}
